cfd_geometry/tesla_cybertruck/standard_closed_bed/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    tarmac
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    upperArea
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    lateralArea
    {
        type            calculated;
        value           uniform 0;
    }
    symmetryPlane
    {
        type            symmetry;
    }
    bodyCassoneChiuso_mm
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    FR_mm
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    RR_mm
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
