cfd_geometry/tesla_cybertruck/standard_closed_bed/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  format ascii;
  class dictionary;
  location "constant";
  object momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS {
  // Tested with kEpsilon, realizableKE, kOmega, kOmega2006, kOmegaSST, v2f,
  // ShihQuadraticKE, LienCubicKE.
  model kOmegaSST;

  turbulence on;

  printCoeffs on;

  viscosityModel Newtonian;
}

//realizableKeCoeffs
//{
//    Cmu     0.09;
//    A0      4.04;
//    C2      1.92;
//    sigmaK  1.0;
//    //alphak      alphak [0 0 0 0 0 0 0] 1.0;
//    //alphaEps      alphaEps [0 0 0 0 0 0 0] 0.76923;
//    //alphah      alphah [0 0 0 0 0 0 0] 1.0;
//}
// ************************************************************************* //
